_______________**Pandas in Python:**________________

In [1]:
import numpy as np
import pandas as pd

In [2]:
details={
    "name":['John', 'Jerry','Harry','Peter'],
    "age":[20,24,21,25],
    "city":['Behari','U.P','Kolkata','Delhi']
}

details

{'name': ['John', 'Jerry', 'Harry', 'Peter'],
 'age': [20, 24, 21, 25],
 'city': ['Behari', 'U.P', 'Kolkata', 'Delhi']}

In [3]:
dt=pd.DataFrame(details)
dt

    name  age     city
0   John   20   Behari
1  Jerry   24      U.P
2  Harry   21  Kolkata
3  Peter   25    Delhi

In [4]:
dt.to_csv('Information.csv')                                   #creating .csv file

In [5]:
 dt.to_csv('Information.csv', index=False)

In [6]:
dt.head(2)                                    #used to show top rows when having big data

    name  age    city
0   John   20  Behari
1  Jerry   24     U.P

In [7]:
dt.tail(2)                                    #used to show bottom rows when having big data

    name  age     city
2  Harry   21  Kolkata
3  Peter   25    Delhi

In [8]:
Info=pd.read_csv('Information.csv')                          #read a file
Info

    name  age     city
0   John   20   Behari
1  Jerry   24      U.P
2  Harry   21  Kolkata
3  Peter   25    Delhi

In [9]:
Info['age'][2]=0            #when need to change value at any index
Info

<ipython-input-9-6b1b728d7528>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Info['age'][2]=0            #when need to change value at any index

    name  age     city
0   John   20   Behari
1  Jerry   24      U.P
2  Harry    0  Kolkata
3  Peter   25    Delhi

In [10]:
Info.index=[1,2,3,4]              #it can also be: ['first','second','third','fourth']
Info

    name  age     city
1   John   20   Behari
2  Jerry   24      U.P
3  Harry    0  Kolkata
4  Peter   25    Delhi

In [11]:
ser=pd.Series(np.random.rand(10))
ser

0    0.232667
1    0.671155
2    0.002552
3    0.026798
4    0.373767
5    0.355506
6    0.409850
7    0.825285
8    0.616152
9    0.309803
dtype: float64

In [12]:
nser=pd.DataFrame(np.random.rand(5,6))              #random values in table
nser

          0         1         2         3         4         5
0  0.061459  0.630611  0.576539  0.824630  0.671650  0.140815
1  0.114979  0.085303  0.695137  0.673510  0.999879  0.450406
2  0.072610  0.957314  0.631512  0.665944  0.414201  0.958743
3  0.165287  0.923322  0.386228  0.703248  0.887267  0.189976
4  0.698575  0.331253  0.411555  0.236519  0.810559  0.579398

In [13]:
nser.loc[0,0]=0.111111            #change value at given row/column
nser

          0         1         2         3         4         5
0  0.111111  0.630611  0.576539  0.824630  0.671650  0.140815
1  0.114979  0.085303  0.695137  0.673510  0.999879  0.450406
2  0.072610  0.957314  0.631512  0.665944  0.414201  0.958743
3  0.165287  0.923322  0.386228  0.703248  0.887267  0.189976
4  0.698575  0.331253  0.411555  0.236519  0.810559  0.579398

In [14]:
rng=np.arange(30)
rng

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29])

In [ ]:
pd.DataFrame(rng)